## <a href='https://www.kaggle.com/datasets/brendan45774/test-file'> **Titanic Dataset**

### Import the required libraries (Pandas, NumPy)

In [6]:
import numpy as np
import pandas as pd

### Import data

In [39]:
df = pd.read_csv('tested.csv')

### What's the shape of the data?

In [41]:
print(df.shape)

(418, 12)

### What are the first 5 rows in data?

In [43]:
print(df.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

### What are the last 5 rows in data?

In [45]:
print(df.tail())

     PassengerId  Survived  Pclass                          Name     Sex  \
413         1305         0       3            Spector, Mr. Woolf    male
414         1306         1       1  Oliva y Ocana, Dona. Fermina  female
415         1307         0       3  Saether, Mr. Simon Sivertsen    male
416         1308         0       3           Ware, Mr. Frederick    male
417         1309         0       3      Peter, Master. Michael J    male

      Age  SibSp  Parch              Ticket      Fare Cabin Embarked
413   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  39.0      0      0            PC 17758  108.9000  C105        C
415  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416   NaN      0      0              359309    8.0500   NaN        S
417   NaN      1      1                2668   22.3583   NaN        C

### What about any (random) 10 rows in data?

In [47]:
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
353,1245,0,2,"Herman, Mr. Samuel",male,49.0,1,2,220845,65.0000,NaN,S
45,937,0,3,"Peltomaki, Mr. Nikolai Johannes",male,25.0,0,0,STON/O 2. 3101291,7.9250,NaN,S
278,1170,0,2,"Ware, Mr. John James",male,30.0,1,0,CA 31352,21.0000,NaN,S
313,1205,1,3,"Carr, Miss. Jeannie",female,37.0,0,0,368364,7.7500,NaN,Q
204,1096,0,2,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5000,NaN,S
385,1277,1,2,"Herman, Miss. Kate",female,24.0,1,2,220845,65.0000,NaN,S
74,966,1,1,"Geiger, Miss. Amalie",female,35.0,0,0,113503,211.5000,C130,C
160,1052,1,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q
263,1155,1,3,"Klasen, Miss. Gertrud Emilia",female,1.0,1,1,350405,12.1833,NaN,S
155,1047,0,3,"Duquemin, Mr. Joseph",male,24.0,0,0,S.O./P.P. 752,7.5500,NaN,S

### Information about the data:

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

### Statistical summary of the **numerical** columns:

In [51]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

### Statistical summary of the **categorical** columns:

In [53]:
df.select_dtypes(include=['object', 'category']).describe()

                    Name   Sex    Ticket            Cabin Embarked
count                418   418       418               91      418
unique               418     2       363               76        3
top     Kelly, Mr. James  male  PC 17608  B57 B59 B63 B66        S
freq                   1   266         5                3      270

### Check if the data contain duplicated values or not, **and if it does**, remove them.

In [57]:
df.duplicated().sum()
## there is no duplicates

0

### Remove any useless column; like the `PassengerId` column:

In [79]:
df = df.drop('PassengerId', axis=1)

KeyError: "['PassengerId'] not found in axis"

### How many missing values in each column in the data?

In [92]:
missing_value = df.isnull().sum()
print(missing_value)

Survived      0
Pclass        0
Name          0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
dtype: int64

### Can you show them in **percentage**?

In [94]:
print((missing_value/len(df))*100)

Survived     0.000000
Pclass       0.000000
Name         0.000000
Sex          0.000000
Age         20.574163
SibSp        0.000000
Parch        0.000000
Ticket       0.000000
Fare         0.239234
Cabin       78.229665
Embarked     0.000000
dtype: float64

### Remove the column with the **most** missing values:

In [106]:
# using filter
col_with_most_missing = missing_value[missing_value == missing_value.max()].index[0]
df = df.drop(columns = [col_with_most_missing])

     Survived  Pclass                                          Name     Sex  \
0           0       3                              Kelly, Mr. James    male
1           1       3              Wilkes, Mrs. James (Ellen Needs)  female
2           0       2                     Myles, Mr. Thomas Francis    male
3           0       3                              Wirz, Mr. Albert    male
4           1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..        ...     ...                                           ...     ...
413         0       3                            Spector, Mr. Woolf    male
414         1       1                  Oliva y Ocana, Dona. Fermina  female
415         0       3                  Saether, Mr. Simon Sivertsen    male
416         0       3                           Ware, Mr. Frederick    male
417         0       3                      Peter, Master. Michael J    male

      Age  SibSp  Parch              Ticket      Fare Embarked
0    34.5      0      0              330911    7.8292        Q
1    47.0      1      0              363272    7.0000        S
2    62.0      0      0              240276    9.6875        Q
3    27.0      0      0              315154    8.6625        S
4    22.0      1      1             3101298   12.2875        S
..    ...    ...    ...                 ...       ...      ...
413   NaN      0      0           A.5. 3236    8.0500        S
414  39.0      0      0            PC 17758  108.9000        C
415  38.5      0      0  SOTON/O.Q. 3101262    7.2500        S
416   NaN      0      0              359309    8.0500        S
417   NaN      1      1                2668   22.3583        C

[418 rows x 10 columns]

### Delete the row with the only missing value in `Fare` column:
> Consider using boolean mask in your approach, **don't** just do `dropna()`

In [130]:
mask = df['Fare'].isnull()
df = df[~mask]
print(df)

     Survived  Pclass                                          Name     Sex  \
0           0       3                              Kelly, Mr. James    male
1           1       3              Wilkes, Mrs. James (Ellen Needs)  female
2           0       2                     Myles, Mr. Thomas Francis    male
3           0       3                              Wirz, Mr. Albert    male
4           1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..        ...     ...                                           ...     ...
413         0       3                            Spector, Mr. Woolf    male
414         1       1                  Oliva y Ocana, Dona. Fermina  female
415         0       3                  Saether, Mr. Simon Sivertsen    male
416         0       3                           Ware, Mr. Frederick    male
417         0       3                      Peter, Master. Michael J    male

      Age  SibSp  Parch              Ticket      Fare Embarked
0    34.5      0      0              330911    7.8292        Q
1    47.0      1      0              363272    7.0000        S
2    62.0      0      0              240276    9.6875        Q
3    27.0      0      0              315154    8.6625        S
4    22.0      1      1             3101298   12.2875        S
..    ...    ...    ...                 ...       ...      ...
413   NaN      0      0           A.5. 3236    8.0500        S
414  39.0      0      0            PC 17758  108.9000        C
415  38.5      0      0  SOTON/O.Q. 3101262    7.2500        S
416   NaN      0      0              359309    8.0500        S
417   NaN      1      1                2668   22.3583        C

[417 rows x 10 columns]

## Working with age column:

### What's the **smallest** age value?

In [136]:
print(df['Age'].min())

0.17

### What's the **largest** age value?

In [ ]:
#show age largest value:
print(df['Age'].max())

### Fill missing values of `Age` column with the column mean:

In [144]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

print(df)

     Survived  Pclass                                          Name     Sex  \
0           0       3                              Kelly, Mr. James    male
1           1       3              Wilkes, Mrs. James (Ellen Needs)  female
2           0       2                     Myles, Mr. Thomas Francis    male
3           0       3                              Wirz, Mr. Albert    male
4           1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..        ...     ...                                           ...     ...
413         0       3                            Spector, Mr. Woolf    male
414         1       1                  Oliva y Ocana, Dona. Fermina  female
415         0       3                  Saether, Mr. Simon Sivertsen    male
416         0       3                           Ware, Mr. Frederick    male
417         0       3                      Peter, Master. Michael J    male

           Age  SibSp  Parch              Ticket      Fare Embarked
0    34.500000      0      0              330911    7.8292        Q
1    47.000000      1      0              363272    7.0000        S
2    62.000000      0      0              240276    9.6875        Q
3    27.000000      0      0              315154    8.6625        S
4    22.000000      1      1             3101298   12.2875        S
..         ...    ...    ...                 ...       ...      ...
413  30.181269      0      0           A.5. 3236    8.0500        S
414  39.000000      0      0            PC 17758  108.9000        C
415  38.500000      0      0  SOTON/O.Q. 3101262    7.2500        S
416  30.181269      0      0              359309    8.0500        S
417  30.181269      1      1                2668   22.3583        C

[417 rows x 10 columns]

### Apply the ceiling function to all the values in the `Age` column and transform it from float to integer:

In [152]:
df['Age'] = np.ceil(df['Age']).astype(int)

### Save all changes in a new excel file called `cleaned_data.xlsx`:

In [216]:
df.to_excel('cleaned_data.xlsx', index = False)

### What did you notice about the data?
> Write your notes and insights in the next empty markdown cell

**Note:** You are free to write any code to help you **get more insights** , it would be nice to do some **filtering** and **grouping** in data

[Your answer]

In [218]:
df_cleaned = pd.read_excel('cleaned_data.xlsx')
print(df_cleaned)

     Survived  Pclass                                          Name     Sex  \
0           0       3                              Kelly, Mr. James    male
1           1       3              Wilkes, Mrs. James (Ellen Needs)  female
2           0       2                     Myles, Mr. Thomas Francis    male
3           0       3                              Wirz, Mr. Albert    male
4           1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..        ...     ...                                           ...     ...
412         0       3                            Spector, Mr. Woolf    male
413         1       1                  Oliva y Ocana, Dona. Fermina  female
414         0       3                  Saether, Mr. Simon Sivertsen    male
415         0       3                           Ware, Mr. Frederick    male
416         0       3                      Peter, Master. Michael J    male

     Age  SibSp  Parch              Ticket      Fare Embarked
0     35      0      0              330911    7.8292        Q
1     47      1      0              363272    7.0000        S
2     62      0      0              240276    9.6875        Q
3     27      0      0              315154    8.6625        S
4     22      1      1             3101298   12.2875        S
..   ...    ...    ...                 ...       ...      ...
412   31      0      0           A.5. 3236    8.0500        S
413   39      0      0            PC 17758  108.9000        C
414   39      0      0  SOTON/O.Q. 3101262    7.2500        S
415   31      0      0              359309    8.0500        S
416   31      1      1                2668   22.3583        C

[417 rows x 10 columns]

In [172]:
# (1) First Note:
## The data is cleaned, with no obvious missing values (e.g., "NA" or "Unknown") in the displayed rows.
## => the Age column become more realistic, as there is no fractins like: 0.17

In [220]:
# (2) Second Note
df_cleaned['Sex'].value_counts(normalize=True) * 100

## the male passengers is more than female

Sex
male      63.549161
female    36.450839
Name: proportion, dtype: float64

In [208]:
# (3) Third Note
df['Survived'].value_counts(normalize=True) * 100

## Majority of passengers died in the Titanic disaster *_*

Survived
0    63.549161
1    36.450839
Name: proportion, dtype: float64

In [240]:
print(df_cleaned)

     Survived  Pclass                                          Name     Sex  \
0           0       3                              Kelly, Mr. James    male
1           1       3              Wilkes, Mrs. James (Ellen Needs)  female
2           0       2                     Myles, Mr. Thomas Francis    male
3           0       3                              Wirz, Mr. Albert    male
4           1       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
..        ...     ...                                           ...     ...
412         0       3                            Spector, Mr. Woolf    male
413         1       1                  Oliva y Ocana, Dona. Fermina  female
414         0       3                  Saether, Mr. Simon Sivertsen    male
415         0       3                           Ware, Mr. Frederick    male
416         0       3                      Peter, Master. Michael J    male

     Age  SibSp  Parch              Ticket      Fare Embarked
0     35      0      0              330911    7.8292        Q
1     47      1      0              363272    7.0000        S
2     62      0      0              240276    9.6875        Q
3     27      0      0              315154    8.6625        S
4     22      1      1             3101298   12.2875        S
..   ...    ...    ...                 ...       ...      ...
412   31      0      0           A.5. 3236    8.0500        S
413   39      0      0            PC 17758  108.9000        C
414   39      0      0  SOTON/O.Q. 3101262    7.2500        S
415   31      0      0              359309    8.0500        S
416   31      1      1                2668   22.3583        C

[417 rows x 10 columns]

In [244]:
# (4) Forth Note
## the percetage of male deads agains Females

dead = df_cleaned[df_cleaned['Survived'] == 0]

dead_gender_percentage = dead['Sex'].value_counts(normalize=True) * 100

print(dead_gender_percentage)

Sex
male    100.0
Name: proportion, dtype: float64

In [246]:
# (5) Fifth Note
df_cleaned['Ticket']
##The "Ticket" column contains a mix of numeric and alphanumeric values, which may require further parsing.

0                  330911
1                  363272
2                  240276
3                  315154
4                 3101298
              ...
412             A.5. 3236
413              PC 17758
414    SOTON/O.Q. 3101262
415                359309
416                  2668
Name: Ticket, Length: 417, dtype: object